{
  "commands": [{
      "name": "EnableCheats",
      "syntax": "EnableCheats <Password>",
      "description": "This command enables access to cheat commands (admincheat), if the given password is correct. The password is set in the server configuration as \"ServerAdminPassword\"."
    }, {
      "name": "SetCheatPlayer",
      "syntax": "SetCheatPlayer <True/False>",
      "description": "This command enables (true) or disables (false) cheats for the player whom executes it."
    }, {
      "name": "AddExperience",
      "syntax": "admincheat AddExperience <Amount> <Tribe Share> <Prevent Sharing With Tribe>",
      "description": "This command adds experience points to the experience amount of the player who executes it."
    }, {
      "name": "AllowPlayerToJoinNoCheck",
      "syntax": "admincheat AllowPlayerToJoinNoCheck <Steam ID>",
      "description": "This command adds a player to the server's whitelist, using their numerical Steam ID."
    }, {
      "name": "DisallowPlayerToJoinNoCheck",
      "syntax": "admincheat DisallowPlayerToJoinNoCheck <SteamID>",
      "description": "This command removes a player from the server's whitelist, using their numerical Steam ID."
    }, {
      "name": "AutoCycle",
      "syntax": "AutoCycle <Duration>",
      "description": "This command provides unlimited health for the specified duration (to the player who executes the command)."
    }, {
      "name": "BanPlayer",
      "syntax": "admincheat BanPlayer <Steam ID>",
      "description": "This command bans the player with the steam ID provided, kicking them from the server and preventing them from ever reconnecting."
    }, {
      "name": "Broadcast",
      "syntax": "admincheat Broadcast <Message>",
      "description": "This command will send the specified message to all players currently connected to the server."
    }, {
      "name": "CE",
      "syntax": "admincheat CE <Type>",
      "description": "This command will change the weather."
    }, {
      "name": "ChangeSize",
      "syntax": "admincheat ChangeSize <Multiplier>",
      "description": "This command will change your character's size. A multiplier of 2 would double your size, 0.5 would half it."
    }, {
      "name": "ClearPlayerInventory",
      "syntax": "admincheat ClearPlayerInventory <Player ID> <Inventory> <Slot Items> <Equipped Items>",
      "description": "This command will clear the inventory of the player with the specified numerical ID."
    }, {
      "name": "ClearTutorials",
      "syntax": "ClearTutorials",
      "description": "This command resets your current tutorial position, meaning it will be re-enabled (if disabled/finished) and play from the start."
    }, {
      "name": "DebugStructures",
      "syntax": "admincheat DebugStructures",
      "description": "This command toggles on or off the structure debug interface."
    }, {
      "name": "DestroyAll",
      "syntax": "admincheat DestroyAll <Entity ID>",
      "description": "This command will remove all creatures of the specified entity/creature ID."
    }, {
      "name": "DestroyAllEnemies",
      "syntax": "admincheat DestroyAllEnemies",
      "description": "This command will clear the map of all non-player creatures. Enemies refers to all creatures, including those that are tamed or non-hostile."
    }, {
      "name": "DestroyMyTarget",
      "syntax": "admincheat DestroyMyTarget",
      "description": "This command will remove the creature, entity or structure that the player's crosshair is over."
    }, {
      "name": "DestroyStructures",
      "syntax": "admincheat DestroyStructures",
      "description": "This command removes all structures that are in the map (including your own)."
    }, {
      "name": "DestroyTribeDinos",
      "syntax": "admincheat DestroyTribeDinos",
      "description": "This command destroys all of the dinos that belong to the tribe of the thing you are currently looking at."
    }, {
      "name": "DestroyTribePlayers",
      "syntax": "admincheat DestroyTribePlayers",
      "description": "This command destroys all of the players that belong to the tribe of the thing you are currently looking at."
    }, {
      "name": "DestroyTribeStructures",
      "syntax": "admincheat DestroyTribeStructures",
      "description": "This command destroys all of the structures that belong to the tribe of the thing you are currently looking at."
    }, {
      "name": "DestroyWildDinos",
      "syntax": "admincheat DestroyWildDinos",
      "description": "This command destroys all of the creatures that are not-yet tamed in the map."
    }, {
      "name": "DisableSpectator",
      "syntax": "admincheat DisableSpectator",
      "description": "This command will take you out of spectator mode."
    }, {
      "name": "DoExit",
      "syntax": "admincheat DoExit",
      "description": "This command will stop/shutdown the server at the soonest possible time."
    }, {
      "name": "DoRestartLevel",
      "syntax": "admincheat DoRestartLevel",
      "description": "This command will restart the map."
    }, {
      "name": "DoTame",
      "syntax": "admincheat DoTame",
      "description": "This command tames the creature you are currently looking at, if it is a creature that can be tamed."
    }, {
      "name": "EnemyInvisible",
      "syntax": "admincheat EnemyInvisible <True/False>",
      "description": "This command will make it so creatures will not attack you, even if provoked."
    }, {
      "name": "ExecSetSleeping",
      "syntax": "admincheat ExecSetSleeping <True/False>",
      "description": "This command will put you to sleep (true) or wake you up (false)."
    }, {
      "name": "Fly",
      "syntax": "admincheat Fly",
      "description": "This command enables fly mode, disabling collisions with all objects. To disable, use the command 'walk'."
    }, {
      "name": "ForceTame",
      "syntax": "admincheat ForceTame",
      "description": "This command will forcefully tame the creature that is behind your crosshair. If tamed with this command, creatures can be ridden without a saddle."
    }, {
      "name": "ForceTameAOE",
      "syntax": "ForceTameAOE <Radius>",
      "description": "This command forcefully tamed every dino within the specified radius."
    }, {
      "name": "ForcePlayerToJoinTargetTribe",
      "syntax": "admincheat ForcePlayerToJoinTargetTribe <Player ID>",
      "description": "This command sets the tribe of the player, specified by their ID, to that of the entity/structure you are currently looking at."
    }, {
      "name": "ForcePlayerToJoinTribe",
      "syntax": "admincheat ForcePlayerToJoinTribe <Player ID> <Tribe Name>",
      "description": "This command forces the player with the specified ID to join the specified tribe."
    }, {
      "name": "ForceTribes",
      "syntax": "admincheat ForceTribes <Player Name> <Player Name> <New Tribe Name>",
      "description": "This command will create a new tribe (name of tribe is the last argument), and force the specified the players to join it."
    }, {
      "name": "GameCommand",
      "syntax": "admincheat GameCommand <Command>",
      "description": "This command runs a command specific to the gamemode the server is currently running."
    }, {
      "name": "GetChat",
      "syntax": "GetChat",
      "description": "This is an RCON command to retrieve the latest chat messages (technically, the 'latest chat buffer') sent on the server."
    }, {
      "name": "GetAllState",
      "syntax": "admincheat GetAllState <Entity ID>",
      "description": "This command prints information about each of the individual entities of the given type currently in the map. It is most commonly used to check if an entity is spawned (as if there is no entity of the specified type, nothing will be printed)."
    }, {
      "name": "GetGameLog",
      "syntax": "GetGameLog",
      "description": "You must launch the server with the -servergamelog argument for this command to work. This command prints 100 entries of the game log."
    }, {
      "name": "GetPlayerIDForSteamID",
      "syntax": "GetPlayerIDForSteamID <Steam ID>",
      "description": "This command <strong>may not work currently</strong> (due to a bug). If working, it will return the player ID (UE4) for the player with the specified steam ID."
    }, {
      "name": "GetSteamIDForPlayerID",
      "syntax": "GetSteamIDForPlayerID <Player ID>",
      "description": "This command <strong>may not work currently</strong> (due to a bug). If working, it will return the Steam ID for the player with the specified player ID (UE4)."
    }, {
      "name": "GetTribeIdPlayerList",
      "syntax": "GetTribeIdPlayerList <Tribe ID>",
      "description": "This command returns a list of players in the tribe with the specified ID."
    }, {
      "name": "GFI",
      "syntax": "admincheat GFI <Blueprint / GFI> <Amount> <Quality> <Force Blueprint>",
      "description": "This command adds an item to your inventory, relative to the blueprint, amount and quality specified. You can specify only part of the blueprint instead of the full blueprint, provided it is a unique part that no other blueprints have (e.g. 'gem' is shared between the Blue Gem, Green Gem and Red Gem, so it cannot be used, but 'Absorbent' is only in 'Absorbent Substrate' so it is fine)."
    }, {
      "name": "Ghost",
      "syntax": "admincheat Ghost",
      "description": "This command enables 'noclip' mode, disabling collisions (allowing you to pass through any objects, including the terrain of the map). Use the 'walk' command to disable this mode."
    }, {
      "name": "GiveAllStructure",
      "syntax": "admincheat GiveAllStructure",
      "description": "This command gives you ownership of the structure (and any connected/touching structures) that your crosshair is on."
    }, {
      "name": "GiveColors",
      "syntax": "admincheat GiveColors <Amount>",
      "description": "This command gives you every dye in the game, specify an amount to receive multiple of each dye (relative to the amount specified, e.g. 3 would give you 3 of each dye)."
    }, {
      "name": "GiveCreativeMode",
      "syntax": "admincheat GiveCreativeMode",
      "description": "This command sets your gamemode to creative mode."
    }, {
      "name": "GiveCreativeModeToTarget",
      "syntax": "admincheat GiveCreativeModeToTarget",
      "description": "This command sets the gamemode of the player/thing your crosshair is over to creative mode."
    }, {
      "name": "GiveCreativeModeToPlayer",
      "syntax": "admincheat GiveCreativeModeToPlayer <Player ID>",
      "description": "This command sets the gamemode of another player to creative mode."
    }, {
      "name": "GiveEngrams",
      "syntax": "admincheat GiveEngrams",
      "description": "This command will unlock all crafting recipes for your character."
    }, {
      "name": "GiveExpToPlayer",
      "syntax": "admincheat GiveExpToPlayer <Player ID> <Amount> <Tribe Share> <Prevent Sharing With Tribe>",
      "description": "This command will give experience points to another player."
    }, {
      "name": "GiveExpToTarget",
      "syntax": "GiveExpToTarget <Amount> <Tribe Share> <Prevent Sharing With Tribe>",
      "description": "This command will give experience points to the player, or dino, that is behind your crosshair."
    }, {
      "name": "GiveInfiniteStatsToTarget",
      "syntax": "GiveInfiniteStatsToTarget",
      "description": "This command will give infinite stats to the player, or dino, that is under your crosshair."
    }, {
      "name": "GiveItem",
      "syntax": "admincheat GiveItem <Blueprint> <Amount> <Quality> <Force Blueprint>",
      "description": "This command adds an item to your inventory, relative to the blueprint, amount and quality specified. Unlike the 'GFI' command, you must specify the <strong>full</strong> blueprint."
    }, {
      "name": "GiveItemNum",
      "syntax": "admincheat GiveItemNum <Item ID> <Amount> <Quality> <Force Blueprint>",
      "description": "This command adds an item to your inventory, relative to the numerical item ID provided. Not all items have a numerical item ID, so it may be best to use the GFI command instead."
    }, {
      "name": "GiveItemToPlayer",
      "syntax": "admincheat GiveItemToPlayer <Player ID> <Blueprint> <Amount> <Quality> <Force Blueprint>",
      "description": "This command adds an item to the inventory of the player with the specified player ID, relative to the blueprint, amount and quality specified. Unlike the 'GFI' command, you must specify the <strong>full</strong> blueprint."
    }, {
      "name": "GiveItemNumToPlayer",
      "syntax": "admincheat GiveItemNumToPlayer <Player ID> <Item ID> <Amount> <Quality> <Force Blueprint>",
      "description": "This command adds an item to the inventory of the player with the specified player ID, relative to the numerical item ID provided. Not all items have a numerical item ID, so it may be best to use the GiveItemToPlayer command instead."
    }, {
      "name": "GiveResources",
      "syntax": "admincheat GiveResources",
      "description": "This command gives you 50 of each resource. Note: due to the weight of all these resources, your movement speed may be severely hindered."
    }, {
      "name": "GiveSlotItem",
      "syntax": "admincheat GiveSlotItem <Blueprint> <Slot Number> <Amount>",
      "description": "This command puts an item (relative to the provided blueprint) in the specified item slot. If there are too many items (stacked), the extra items will be placed into your inventory."
    }, {
      "name": "GiveSlotItemNum",
      "syntax": "admincheat GiveSlotItemNum <Item ID> <Slot Number> <Amount>",
      "description": "This command puts an item (relative to the provided item ID) in the specified item slot. If there are too many items (stacked), the extra items will be placed into your inventory."
    }, {
      "name": "GiveToMe",
      "syntax": "admincheat GiveToMe",
      "description": "This command will make you the owner of the entity that your crosshair is currently over. Note: it will <strong>not tame</strong> creatures, it will only make you the owner - to tame a creature, use the tame command."
    }, {
      "name": "GMBuff",
      "syntax": "admincheat GMBuff",
      "description": "This command will give you near unlimited experience, enable EnemyInvisible (so that creatures do not attack you), infinite stats and make you invincible (god mode)."
    }, {
      "name": "GMSummon",
      "syntax": "admincheat GMSummon <\"Entity ID\"> <Creature Level>",
      "description": ""
    }, {
      "name": "God",
      "syntax": "admincheat God",
      "description": "This command will make your character enter god mode if you are not already in god mode. If you are already in god mode, it will disable it. God mode makes you invincible to most forms of damage. You can still die via drowning when in god mode, so if you do not wish to drown, you will need to use the InfiniteStats command."
    }, {
      "name": "HideTutorial",
      "syntax": "HideTutorial <Tutorial ID>",
      "description": "This command will completely hide a tutorial, relative to the tutorial ID/index provided: either '0' (Blank) or '1' (Your first day)"
    }, {
      "name": "HurtMe",
      "syntax": "admincheat HurtMe <Amount>",
      "description": "This command causes damage to your player, relative to the amount specified"
    }, {
      "name": "InfiniteStats",
      "syntax": "admincheat InfiniteStats",
      "description": "This command will give you infinite stats: health, oxygen, stamina, food and water."
    }, {
      "name": "KickPlayer",
      "syntax": "admincheat KickPlayer <Steam ID>",
      "description": "This command will kick a player, specified by their Steam ID, from the server (disconnects them). This does not ban a player."
    }, {
      "name": "Kill",
      "syntax": "admincheat Kill",
      "description": "This command will kill the entity or structure that is currently behind your crosshair."
    }, {
      "name": "KillPlayer",
      "syntax": "admincheat KillPlayer <Player ID>",
      "description": "This command will kill the player with the player ID specified."
    }, {
      "name": "KillAOE",
      "syntax": "KillAOE <Category> <Radius>",
      "description": "This command will destroy all of the specified category within the specified radius. Categories are: pawns, dinos, tamed, players, wild, structures."
    }, {
      "name": "LeaveMeAlone",
      "syntax": "admincheat LeaveMeAlone",
      "description": "This command will put you in god mode (God), give you infinite stats (InfiniteStats) and make creatures not attack you (EnemyInvisible)."
    }, {
      "name": "ListPlayers",
      "syntax": "admincheat ListPlayers",
      "description": "The command will send you a list of all players who are connected to the server, along with their Steam IDs."
    }, {
      "name": "MakeTribeAdmin",
      "syntax": "admincheat MakeTribeAdmin",
      "description": "This command will make you an admin of your current tribe."
    }, {
      "name": "MakeTribeFounder",
      "syntax": "admincheat MakeTribeFounder",
      "description": "This command will make you the founder of your current tribe."
    }, {
      "name": "OnToggleInGameMenu",
      "syntax": "OnToggleInGameMenu",
      "description": "This command will toggle the in-game menu."
    }, {
      "name": "OpenMap",
      "syntax": "admincheat OpenMap <Map Name>",
      "description": "This command will load a map, relative to the specified map name."
    }, {
      "name": "PlayersOnly",
      "syntax": "admincheat PlayersOnly",
      "description": "This command will halt all creature movement, and stop/prevent crafting. Enter the command again to re-enable creature movement/crafting. This command does not affect players (only creatures)."
    }, {
      "name": "PrintColors",
      "syntax": "PrintColors",
      "description": "This command will print the IDs of all colors."
    }, {
      "name": "RainCritters",
      "syntax": "RainCritters <Amount> <Spread Radius> <Height>",
      "description": "This command will spawn a random selection of sheep and dodos above you."
    }, {
      "name": "RemoveTribeAdmin",
      "syntax": "admincheat RemoveTribeAdmin",
      "description": "This command will remove all admins (other than yourself) from your current tribe"
    }, {
      "name": "RenamePlayer",
      "syntax": "admincheat RenamePlayer <\"Player Name\"> <New Name>",
      "description": "This command will change a player's name."
    }, {
      "name": "RenameTribe",
      "syntax": "admincheat RenameTribe <Tribe Name> <New Name>",
      "description": "This command will change a tribe's name."
    }, {
      "name": "RequestSpectator",
      "syntax": "RequestSpectator <Password>",
      "description": "This command will put you in spectator mode, if the password provided is correct. Password is set in GameUserSettings.ini under 'SpectatorPassword'."
    }, {
      "name": "SaveWorld",
      "syntax": "admincheat SaveWorld",
      "description": "This command forcefully saves the map (on both servers and singleplayer)."
    }, {
      "name": "ScriptCommand",
      "syntax": "admincheat ScriptCommand <Command>",
      "description": "This command runs a command or script that is specific to the servers current game mode."
    }, {
      "name": "SDF",
      "syntax": "admincheat SDF <Creature ID> <Tamed>",
      "description": "This command spawns a creature in-front of you with a random level, relative to the creature ID specified."
    }, {
      "name": "ServerChat",
      "syntax": "admincheat ServerChat <Message>",
      "description": "This command sends a message in the chat to all players currently connected to the server."
    }, {
      "name": "ServerChatTo",
      "syntax": "admincheat ServerChatTo <Steam ID> <Message>",
      "description": "This command will send a PM from the server to the player with the steam ID specified."
    }, {
      "name": "ServerChatToPlayer",
      "syntax": "admincheat ServerChatToPlayer <Name> <Message>",
      "description": "This command will send a PM from the server to the player with the name (not ID) specified."
    }, {
      "name": "SetAdminIcon",
      "syntax": "admincheat SetAdminIcon <True/False>",
      "description": "This command will show or hide your admin icon in the in-game chat that by default shows when cheats are enabled."
    }, {
      "name": "SetBabyAge",
      "syntax": "admincheat SetBabyAge <Age>",
      "description": "This command will set the age of the creature (provided it is a baby) behind your crosshair."
    }, {
      "name": "SetFacialHairPercent",
      "syntax": "admincheat SetFacialHairPercent <Percentage>",
      "description": "This command sets your facial hair percentage."
    }, {
      "name": "SetFacialHairStyle",
      "syntax": "admincheat SetFacialHairStyle <Facial Hair ID>",
      "description": "This command will set the style of your facial hair, relative to the facial hair ID specified (0-7)."
    }, {
      "name": "SetGlobalPause",
      "syntax": "admincheat SetGlobalPause <True/False>",
      "description": "This command will completely pause (or unpause) the game/server."
    }, {
      "name": "SetGodMode",
      "syntax": "admincheat SetGodMode <True/False>",
      "description": "This command to enable or disable god mode. God mode prevents your character from taking most forms of damage (you can still drown)."
    }, {
      "name": "SetGraphicsQuality",
      "syntax": "SetGraphicsQuality <Quality>",
      "description": "This command sets your client's graphics quality, relative to the 'quality' number provided (0-3)."
    }, {
      "name": "SetHeadHairPercent",
      "syntax": "admincheat SetHeadHairPercent <Percentage>",
      "description": "This command sets the percentage of hair that is on your characters head."
    }, {
      "name": "SetHeadHairStyle",
      "syntax": "admincheat SetHeadHairStyle <Hair ID>",
      "description": "This command will set the style of your hair, relative to the hair ID specified (0-7)."
    }, {
      "name": "SetImprintQuality",
      "syntax": "admincheat SetImprintQuality <Percentage>",
      "description": "This command will set the quality of the entity under your crosshair."
    }, {
      "name": "SetMessageOfTheDay",
      "syntax": "admincheat SetMessageOfTheDay <Message>",
      "description": "This command sets the MOTD (message of the day). The MOTD is a message that is displayed to a player when they connect to the server."
    }, {
      "name": "SetShowAllPlayers",
      "syntax": "admincheat SetShowAllPlayers <True/False>",
      "description": "This command enables/disables names when in spectator mode."
    }, {
      "name": "SetTargetDinoColor",
      "syntax": "admincheat SetTargetDinoColor <Region> <Color ID>",
      "description": "The command will set the color of the dino (relative to the color ID and region specified) your crosshair is currently over."
    }, {
      "name": "SetTargetPlayerBodyVal",
      "syntax": "admincheat SetTargetPlayerBodyVal <Body Region ID> <Scale>",
      "description": "This command allows you to resize a specific part of a character's body."
    }, {
      "name": "SetTargetPlayerColorVal",
      "syntax": "admincheat SetTargetPlayerColorVal <Body Part> <Color>",
      "description": "This command allows you to recolor a specific part of a character's body."
    }, {
      "name": "SetPlayerPos",
      "syntax": "admincheat SetPlayerPos <X> <Y> <Z>",
      "description": "This command will teleport your character to the specified coordinates."
    }, {
      "name": "SetTimeOfDay",
      "syntax": "admincheat SetTimeOfDay <Hour>:<Minute>[:<Second>]",
      "description": "This command sets the time of the day in the current game world."
    }, {
      "name": "ShowInGameMenu",
      "syntax": "ShowInGameMenu",
      "description": "This command will show the in-game menu."
    }, {
      "name": "ShowMessageOfTheDay",
      "syntax": "ShowMessageOfTheDay",
      "description": "This command will send you a chat message with the server's current MOTD (message of the day)."
    }, {
      "name": "ShowTutorial",
      "syntax": "ShowTutorial <Tutorial ID> <Force Display>",
      "description": "This command shows a tutorial, relative to the tutorial ID entered."
    }, {
      "name": "Slomo",
      "syntax": "admincheat Slomo <Multiplier>",
      "description": "This command sets the speed multiplier of the game, allowing you to speed it up or slow it down, 1 is default/normal speed."
    }, {
      "name": "SpawnActor",
      "syntax": "admincheat SpawnActor <Blueprint> <Spawn Distance> <Y Offset> <Z Offset>",
      "description": "This command spawns an entity, relative to the blueprint specified, with a random level."
    }, {
      "name": "SpawnActorSpread",
      "syntax": "admincheat SpawnActorSpread <Blueprint> <Spawn Distance> <Y Offset> <Z Offset> <Amount> <Radius>",
      "description": "This command spawns a given amount of entities, relative to the blueprint specified."
    }, {
      "name": "SpawnDino",
      "syntax": "admincheat SpawnDino <Blueprint> <Spawn Distance> <Y Offset> <Z Offset> <Level>",
      "description": "This command spawns an entity (creature or dinosaur), relative to the blueprint path and level specified. Specify Y/Z offsets to change the location it will spawn at (relative to your character)."
    }, {
      "name": "Suicide",
      "syntax": "Suicide",
      "description": "This command will forcefully kill your character."
    }, {
      "name": "Summon",
      "syntax": "admincheat Summon <Entity ID>",
      "description": "This command will spawn a creature, relative to the entity ID specified."
    }, {
      "name": "SummonTamed",
      "syntax": "admincheat SummonTamed <Entity ID>",
      "description": "This command will spawn a tamed creature, relative to the entity ID specified."
    }, {
      "name": "TakeAllDino",
      "syntax": "admincheat TakeAllDino",
      "description": "This command will forcefully make your tribe the owner of <strong>all dinos</strong> that belong to the tribe of the entity/structure your crosshair is over."
    }, {
      "name": "TakeAllStructure",
      "syntax": "admincheat TakeAllStructure",
      "description": "This command will forcefully make your tribe the owner of <strong>all structures</strong> that belong to the tribe of the entity/structure your crosshair is over."
    }, {
      "name": "Teleport",
      "syntax": "admincheat Teleport",
      "description": "This command will move your character forward (very fast) until you collide with something."
    }, {
      "name": "TeleportPlayerIDToMe",
      "syntax": "admincheat TeleportPlayerIDToMe <Player ID>",
      "description": "This command will teleport a player to you, specified by their player ID (UE4)."
    }, {
      "name": "TeleportPlayerNameToMe",
      "syntax": "admincheat TeleportPlayerNameToMe <Player Name>",
      "description": "This command will teleport a player to you, specified by their player name (not ID)."
    }, {
      "name": "TeleportToPlayer",
      "syntax": "admincheat TeleportToPlayer <Player ID>",
      "description": "This command will teleport you to the player with the specified player ID (UE4)."
    }, {
      "name": "TestSteamRefreshItems",
      "syntax": "admincheat TestSteamRefreshItems",
      "description": "This command will check that Steam can refresh items."
    }, {
      "name": "ToggleInfiniteAmmo",
      "syntax": "admincheat ToggleInfiniteAmmo",
      "description": "The command will toggle on or off unlimited ammo for any weapons that your character fires."
    }, {
      "name": "UnbanPlayer",
      "syntax": "admincheat UnbanPlayer <Steam ID>",
      "description": "This command will unban a player from the server, relative to the Steam ID specified."
    }, {
      "name": "UnlockEngram",
      "syntax": "admincheat UnlockEngram <Blueprint>",
      "description": "This command will unlock Tek Engrams/Tekgrams, specified by their blueprint path."
    }, {
      "name": "Walk",
      "syntax": "admincheat Walk",
      "description": "This command deactivates fly mode, meaning your character will again by affected by the game's physics."
    }, {
      "name": "Stat",
      "syntax": "Stat <Stat Type>",
      "description": "This command toggles on-screen debug information for the specified stat. Types are: FPS, Levels, Unit and UnitGraph."
    }, {
      "name": "ShowDebug",
      "syntax": "ShowDebug <Debug Type>",
      "description": "This command shows debug information overlays, relative to the debug type specified. Types: reset (disables all debug screens), physics, camera, bones, animation, input, collision, net, weapon and ai."
    }, {
      "name": "ShowMyAdminManager",
      "syntax": "ShowMyAdminManager",
      "description": "This command opens the admin management interface, which has a lot of useful admin tools."
    }, {
      "name": "EnableSpectator",
      "syntax": "admincheat EnableSpectator",
      "description": "This command enables spectator mode for your character."
    }, {
      "name": "StopSpectating",
      "syntax": "StopSpectating",
      "description": "This command disables spectator mode for your character."
    }, {
      "name": "ToggleGun",
      "syntax": "ToggleGun",
      "description": "This command toggles the visibility of the item in your hands. If you do not have an item in your hands, and this setting is enabled, your hands will be hidden."
    }, {
      "name": "TribeMessage",
      "syntax": "admincheat TribeMessage <Tribe ID> <Message>",
      "description": "This admin command sends a message to the tribe with the specified ID."
    }, {
      "name": "TPCoords",
      "syntax": "admincheat TPCoords <GPS Latitude> <GPS Longitude>",
      "description": "This command will teleport your character to the specified GPS coordinates (latitude and longitude, <em>not X, Y, Z</em>."
    }, {
      "name": "SPI",
      "syntax": "admincheat SPI <X> <Y> <Z> <Yaw> <Pitch>",
      "description": "This console command will teleport your character to the specified coordinates, and make your character face the specified yaw and pitch."
    }, {
      "name": "DestroyTribeId",
      "syntax": "admincheat DestroyTribeId <Tribe ID>",
      "description": "This console command will delete the tribe with the specified tribe ID."
    }, {
      "name": "DestroyTribeIdDinos",
      "syntax": "admincheat DestroyTribeIdDinos <Tribe ID>",
      "description": "This console command will kill all dinos that the tribe with the specified tribe ID has tamed."
    }, {
      "name": "DestroyTribeIdPlayers",
      "syntax": "admincheat DestroyTribeIdPlayers <Tribe ID>",
      "description": "This cheat command will kill all players in the tribe with the specified tribe ID."
    }, {
      "name": "DestroyTribeIdStructures",
      "syntax": "admincheat DestroyTribeIdStructures <Tribe ID>",
      "description": "This command will destroy all structures that belong to the tribe with the specified ID."
    }, {
      "name": "HideRiders",
      "syntax": "admincheat HideRiders <True / False>",
      "description": "This command will make players (or other riders) of dinosaurs invisible. After unmounting, they will stay invisible - they will need to rejoin the game, or turn this feature off to become visible again."
    }, {
      "name": "RefillStats",
      "syntax": "admincheat RefillStats",
      "description": "This command will replenish your health, stamina, oxygen, water, food and other depletable stats. Unlike the InfiniteStats command, your stats will continue to drain/be affected by the game after executing this command."
    }, {
      "name": "GiveArmorSet",
      "syntax": "admincheat GiveArmorSet <Armor Type> <Quality>",
      "description": "This command gives you a full set of the specified armor tier, with the specified quality. It will be equipped to your character (not placed in your inventory). Types:<ul><li>cloth</li><li>chitin</li><li>metal</li><li>riot</li><li>hazard</li><li>tek</li></ul>"
    }, {
      "name": "GiveWeaponSet",
      "syntax": "admincheat GiveWeaponSet <Weapon Set #> <Quality>",
      "description": "This command gives you a set of weapons. Tier options are:<ul><li>0 - a bow, pike, spear and bola</li><li>1 - an assault rifle, shotgun, longneck rifle, sword and grenade</li><li>2 - compound bow, fabricated sniper rifle, rocket launcher, C4 charge</li><li>3 - a tek grenade, tek railgun, tek rifle and tek sword</li></ul>"
    }, {
      "name": "GiveItemSet",
      "syntax": "admincheat GiveItemSet <Item Set #>",
      "description": "This command gives you a set of items. Item set numbers:<ul><li>0 - 200 stimberries, 90 cooked meat and 2 waterskins</li><li>1 - 200 stimberries, 100 medical brews, 90 cooked meat and 2 water jars</li><li>100 energy brews, 100 medical brews, 100 cactus broth, 60 cooked meat jerky and 2 canteens</li><li>3 - 100 cactus broth, 100 medical brews, 100 energy brews, 90 cooked meat jerky, 5 shadow steak sautes, 5 enduro stews, 5 focal chilis and 5 lazaurs chowders</li></ul>"
    }, {
      "name": "ClearMyBuffs",
      "syntax": "admincheat ClearMyBuffs",
      "description": "This command will clear all of the buffs (status effects) your character has attained (from things like enduro stews, etc)."
    }, {
      "name": "RainDinos",
      "syntax": "RainDinos <Amount> <Spread Radius> <Height>",
      "description": "This console command will spawn a random selection of trikes and parasaurs above your character."
    }, {
      "name": "RainDanger",
      "syntax": "RainDanger <Amount> <Spread Radius> <Height>",
      "description": "This console command will spawn a random selection of Tyrannosauruses and Al losauruses above your character."
    }, {
      "name": "StartNearestHorde",
      "syntax": "admincheat StartNearestHorde <Crate / Element> <1 - 4>",
      "description": "Provided you are playing on Extinction (this is an Extinction-only command), this command will spawn either an Element Node, or an Orbital Supply Drop. To spawn an Orbital Supply Drop, specify 'Crate' as the type, to spawn an Element Node, specify 'Element' as the type. Difficulty is a number ranging from 1 to 4, 1 being the easiest and 4 being legendary."
    }, {
      "name": "ListActiveHordeEvents",
      "syntax": "admincheat ListActiveHordeEvents",
      "description": "Extinction only command. This admin command will print all Orbital Supply Drops and Element Nodes that are currently active to the extended console, along with their location (X, Y, and Z coordinates). The extended console can be opened by pressing the TAB key with the console already open."
    }, {
      "name": "ToggleDamageNumbers",
      "syntax": "admincheat ToggleDamageNumbers",
      "description": "This console command enables and disables (toggles) floating damage numbers on the server it is executed on. If floating damage numbers are enabled when you run this command, it will disable them (and vice versa)."
    }, {
      "name": "HatchEgg",
      "syntax": "admincheat HatchEgg",
      "description": "This admin command instantly completes the incubation progress of the egg you are currently looking at (i.e. that your crosshair is over). Because this command only sets the incubation progress of an egg to 0%, you will need to make sure that hatching conditions (temperature) are met in order for the egg to hatch."
    }, {
      "name": "TribeStructureAudit",
      "syntax": "admincheat TribeStructureAudit <Tribe ID>",
      "description": "This command will list all of the structures the tribe with the specified Tribe ID has, along with the amount of each structure that they have."
    }, {
      "name": "TribeDinoAudit",
      "syntax": "admincheat TribeDinoAudit <Tribe ID>",
      "description": "This console command will list all of the dinos that the tribe with the specified ID has, along with the amount of each dino that they have."
    }, {
      "name": "LevelUp",
      "syntax": "admincheat LevelUp <Stat ID> <Levels>",
      "description": "This command will level up the stat with the specified ID (see arguments for a list of IDs) by the amount you specify. Running this command when riding a dinosaur will level up the specific stat for the dinosaur you are riding (rather than yourself)."
    }, {
      "name": "LevelUpAOE",
      "syntax": "admincheat LevelUpAOE <Stat ID> <Radius> <Levels>",
      "description": "This console command is similar to the LevelUp command, but instead of only levelling yourself up, it will level up a stat for all players and dinosaurs within the specified radius. For example, you could level up all players and dinos Stamina by 5 within a 25 meter radius. See arguments for a list of stat IDs."
    }, {
      "name": "LevelUpTarget",
      "syntax": "admincheat LevelUpTarget <Stat ID> <Levels>",
      "description": "This command levels up the specified stat by the specified amount for the player or dinosaur that your crosshair is over. See arguments for a list of all of the stat IDs."
    }, {
      "name": "TeleportToPlayerName",
      "syntax": "admincheat TeleportToPlayerName <Player Name>",
      "description": "This command will teleport you to the player with the specified in-game name."
    }, {
      "name": "TeleportToActorLocation",
      "syntax": "admincheat TeleportToActorLocation <Actor ID>",
      "description": "This admin command will teleport you to the location of the actor with the specified actor ID."
    }, {
      "name": "TP",
      "syntax": "admincheat TP <Location Code>",
      "description": "This command will teleport you to a predefined location. There are 31 predefined locations you can teleport to, see argument information for a full list."
    }, {
      "name": "MoveTargetTo",
      "syntax": "admincheat MoveTargetTo <X> <Y> <Z>",
      "description": "This command will teleport the the player, dinosaur, or entity that your crosshair is over to the specified X, Y, and Z coordinates."
    }, {
      "name": "TeleportToActiveHorde",
      "syntax": "admincheat TeleportToActiveHorde <Horde ID>",
      "description": "This console command will teleport you to the horde event with the specified ID."
    }, {
      "name": "ForceJoinTribe",
      "syntax": "admincheat ForceJoinTribe",
      "description": "This command will make you forcefully join the tribe of the player, dino, or structure that your crosshair is over -- i.e. if you look at a structure belonging to tribe A and type this command, you will join tribe A."
    }, {
      "name": "TakeTribe",
      "syntax": "admincheat TakeTribe <Tribe ID>",
      "description": "This admin command will transfer all of the dinosaurs and structures of the tribe with the specified ID to you."
    }, {
      "name": "GiveEngramsTekOnly",
      "syntax": "admincheat GiveEngramsTekOnly",
      "description": "This console command will instantly give you all of the Tek Engrams until you leave the server."
    }, {
      "name": "GiveTekEngramsTo",
      "syntax": "admincheat GiveTekEngramsTo <Player ID> <GFI Code>",
      "description": "This command will give and permanently unlock the Tek Engram with the specified ID for the player with the specified player ID. Tek Engram IDs are the same as the GFI code for the item."
    }, {
      "name": "Playercommand",
      "syntax": "admincheat Playercommand <Ascend1 / Ascend2 / Ascend3>",
      "description": "This console command will give you an Ascension effect. Specify 'Ascend1' (without quotes) for Gamma Ascension,'Ascend2' (without quotes) for Beta Ascension, or 'Ascend3' (without quotes) for Alpha Ascension."
    }, {
      "name": "SetMyTargetSleeping",
      "syntax": "admincheat SetMyTargetSleeping <0 / 1>",
      "description": "This command, if you specify '1' (without quotes) as an argument will put to sleep (knock out) the dinosaur, player, or entity, that your crosshair is over. If '0' (without quotes) is specified as an argument, it will wake up the player or dino under your crosshair."
    }, {
      "name": "MaxAscend",
      "syntax": "admincheat MaxAscend <Player ID>",
      "description": "This console command unlocks the Alpha Rockwell and Alpha Overseer Ascensions for the player with the specified player ID. You need to upload and re-download your save in order for the implant to change - the other Ascension Effects (Tek Engrams, levels) will apply instantly (no need to upload/re-download)."
    }, {
      "name": "DefeatBoss",
      "syntax": "admincheat DefeatBoss <Player ID> <Boss ID> <0 / 1 / 2>",
      "description": "This admin command will defeat/unlock the specified boss for the player with the specified ID. You also need to specify a difficulty (0 for Gamma, 1 for Beta, or 2 for Alpha). Unlocking a boss will instantly give the player all of the Tek Engrams associated with it. They will be need to die and respawn in order for the levels and implant to change. See argument information for boss IDs."
    }, {
      "name": "DefeatAllBosses",
      "syntax": "admincheat DefeatAllBosses <Player ID / 0>",
      "description": "This command will defeat and unlock all Alpha difficulty bosses for the player with the specified player ID. Specify 0 as the player ID to unlock all Alpha bosses for yourself."
    }, {
      "name": "DumpDinoStats",
      "syntax": "admincheat DumpDinoStats",
      "description": "This is a debug command that can will print to the console all of the statistics and information there is about a dinosaur. If you are riding a dino when you run this command, the information will be printed for this dino, otherwise, this command will print information about the dino that your crosshair is over."
    }, {
      "name": "SetImprintedPlayer",
      "syntax": "admincheat SetImprintedPlayer <\"Player Name\"> <Player ID>",
      "description": "This command will change the imprinted player for the dinosaur that your crosshair is over to the player with the specified name and ID. Use TransferImprints to transfer all of a player's imprinted dinos to you."
    }, {
      "name": "TransferImprints",
      "syntax": "admincheat TransferImprints <Player ID> <Player ID> <\"Player Name\">",
      "description": "This console command transfers all of a player's imprinted dinos to another player - i.e. all dinos that are imprinted to player A will become imprinted on player B instead. First player ID is the player who initially had the imprinted dinos, the second player ID is the player who the imprints will be transferred to."
    }, {
      "name": "GiveDinoSet",
      "syntax": "admincheat GiveDinoSet <Tier ID> <0 / Amount>",
      "description": "This admin command will spawn a set of dinos, relative to the tier you specify. See tier ID argument information for a list of tier IDs and what dinos are in each tier. You also need to specify a quantity (0 for the entire set) of dinos that should spawn."
    }, {
      "name": "SpawnSetupDino",
      "syntax": "admincheat SpawnSetupDino <\"Blueprint Path\"> <\"Blueprint Path\" (Saddle)> <Saddle Quality> <Level> <Stats> <Spawn Distance> <Y Offset> <Z Offset>",
      "description": "This command will spawn a dinosaur (specified by blueprint path) with your desired configuration. This command allows you to specify the saddle, level, stats, and location of the spawned dino."
    }, {
      "name": "ForcePoop",
      "syntax": "admincheat ForcePoop",
      "description": "This cheat command makes a dinosaur poop. If you are riding a dino when you run this command, it will make that dino poop, otherwise, it will make the dino that your crosshair is over poop."
    },
    {
      "name": "ForceCompleteActiveMission",
      "syntax": "admincheat ForceCompleteActiveMission 0",
      "description": "This cheat lets you complete the active mission on Genesis 1 and 2."
    },
    {
      "name": "ClearCryoSickness",
      "syntax": "admincheat ClearCryoSickness",
      "description": "This command will heal the Cryo Sickness of the dinosaur that is under your crosshair, waking it up."
    }, {
      "name": "Dino Reset",
      "syntax": "admincheat Dino Reset",
      "description": "If you are looking at or riding an Enforcer when you run this console command, it will reset all existing blink cooldowns for the Enforcer (its teleport ability). If you are looking at or riding a Mek, it will reset its fuel and heat levels to 100% and 0, respectively."
    }, {
      "name": "Dino InfiniteBlink",
      "syntax": "admincheat Dino InfiniteBlink",
      "description": "This console command will disable blink cooldowns for the Enforcer you are currently riding or that your crosshair is over. This allows for blinks without a cooldown in between. Not recommended if playing seriously as without the cooldowns the Enforcer will teleport a lot."
    }, {
      "name": "DinoSet Cooldowns",
      "syntax": "admincheat DinoSet Cooldowns <Amount>",
      "description": "This admin command sets the blink cooldown slot amount of the Enforcer that you are riding or looking at (the amount of additional teleport charges it can gain)."
    }, {
      "name": "Dino DontHideRiderDuringBlink",
      "syntax": "admincheat Dino DontHideRiderDuringBlink",
      "description": "This enables and disables (toggles) interference with rider visibility when the Enforcer blinks. Affects the Enforcer that you are currently riding, or the Enforcer that you are looking at (i.e. the enforcer your crosshair is over)."
    }, {
      "name": "DinoSet Blink",
      "syntax": "admincheat DinoSet Blink <0 - 1>",
      "description": "This command sets the percentage the Enforcer can blink forwards -- the percentage should be given as a decimal 0.5 = 50%, 0.34 = 34%. Affects the Enforcer that you are currently riding, or the Enforcer that you are looking at (i.e. the enforcer your crosshair is over)."
    }, {
      "name": "DinoSet BlinkBack",
      "syntax": "admincheat DinoSet BlinkBack <0 - 1>",
      "description": "This command sets the percentage the Enforcer can blink backwards -- the percentage should be given as a decimal 0.5 = 50%, 0.34 = 34%. Affects the Enforcer that you are currently riding, or the Enforcer that you are looking at (i.e. the enforcer your crosshair is over)."
    }, {
      "name": "Dino Inflate",
      "syntax": "admincheat Dino Inflate",
      "description": "This cheat command fully inflates the Gasbag that you are currently riding or looking at - i.e. it will set its inflation to the maximum possible level."
    }, {
      "name": "DinoSet Inflate",
      "syntax": "admincheat DinoSet Inflate <Amount>",
      "description": "This admin command will increase or decrease a Gasbag's inflation by the amount specified. Specify negative numbers to decrease a Gasbag's inflation. The Gasbag that this command has an effect on is the one you are looking at (i.e. under your crosshair, in the middle of your screen), or if you are riding a Gasbag, the one you are riding."
    }, {
      "name": "Dino InfiniteGas",
      "syntax": "admincheat Dino InfiniteGas",
      "description": "This is a toggle command -- i.e. using it on a Gasbag will turn the feature on, but you can run it again (while looking at the same Gasbag) to disable it. It will enable infinite inflation for the Gasbag you are looking at or riding. This is different to the \"Dino Inflate\" command in that it will not deflate at all until you toggle it off."
    }, {
      "name": "Dino InfiniteFuel",
      "syntax": "admincheat Dino InfiniteFuel",
      "description": "This is a toggle command, running it again while targeting the same dino will disable it. It will give the Mek that you are looking at or riding infinite maximum fuel. This is different to the Reset command because the fuel will not run out until you toggle it off."
    }, {
      "name": "DinoSet Fuel",
      "syntax": "admincheat DinoSet Fuel <Amount>",
      "description": "This console command will increase or decrease the fuel level of the Mek you are currently looking at or riding by the specified amount."
    }, {
      "name": "Dino NoHeat",
      "syntax": "admincheat Dino NoHeat",
      "description": "This command gives the Mek you are looking at or riding infinite 0% heat -- i.e. they can hover forever and not overheat. Note that this is a toggle command, run it again while looking at/riding the same dino to disable it."
    }, {
      "name": "Dino ToggleUpkeep",
      "syntax": "admincheat Dino ToggleUpkeep",
      "description": "This is a toggle command. Using this command while looking at or riding a Mek will disable the upkeep system (i.e. health and fuel is no longer subtracted every minute). Running it again whilst riding or looking at a Mek you've disabled it on will re-enable it."
    }, {
      "name": "DinoSet UpkeepInterval",
      "syntax": "admincheat DinoSet UpkeepInterval <Seconds>",
      "description": "This console command sets the interval, in seconds, between each update of the Mek's upkeep system. Default is 60."
    }, {
      "name": "Dino ReplayIntro",
      "syntax": "admincheat Dino ReplayIntro",
      "description": "This command will replay the VFX intro for the Mega Mek that is behind your crosshair."
    }, {
      "name": "DinoSet Blink",
      "syntax": "admincheat DinoSet Blink <0 - 1>",
      "description": ""
    }, {
      "name": "DinoSet EatTime",
      "syntax": "admincheat DinoSet EatTime <Seconds>",
      "description": "This admin commands sets the amount of time, in seconds, that the Gacha you are looking at or riding takes to eat/digest."
    }, {
      "name": "Dino DestroyRightNode",
      "syntax": "admincheat Dino DestroyRightNode",
      "description": "This console command destroys the right arm and node of the Forest Titan that you are looking at."
    }, {
      "name": "Dino DestroyLeftNode",
      "syntax": "admincheat Dino DestroyLeftNode",
      "description": "This console command destroys the left arm and node of the Forest Titan that you are looking at."
    }, {
      "name": "Dino DestroyCenterNode",
      "syntax": "admincheat Dino DestroyCenterNode",
      "description": "This console command destroys center node of the Forest Titan that you are looking at."
    }, {
      "name": "CopyCoordsToClipboard",
      "syntax": "admincheat CopyCoordsToClipboard",
      "description": "This console command will copy to your clipboard your X, Y, Z, Pitch, and Yaw coordinates. This is useful for commands, teleports, etc."
    }
  ]
}